
[


{
    "id": "post-m098a1",
    "uploadTime": "2025-12-26T13:11:50.691Z",
    "title": "Toxic: A Fairy Tale for Grown-Ups Full Movie Download | Full HD 1080p | A Dark Cinematic Experience",
    "mediaImage": "https://i.ytimg.com/vi/0PfErHA3zzQ/hq720.jpg",
    "videoDuration": "02:28:58",
    "paragraphs": [
        "Directed by GEETHU MOHANDAS and produced by KVN PRODUCTIONS, Toxic: A Fairy Tale for Grown-Ups presents YASH in a raw, transformative role shaped by the creators’ intent to explore power, morality, and human obsession through a bold cinematic lens. The film’s striking visuals and intense character-driven narrative have already sparked massive anticipation, with audiences praising its ambition and depth, expecting a gripping, immersive EXPERIENCE that challenges conventional storytelling.",
        "Watch or download Toxic Full Movie in Full HD 1080p now and step into a bold new cinematic world."
    ],
    "hashtags": "#filmixo #viralfilm #trendingmovie #blockbuster #popular",
    "downloadLink2": "https://prototypesorting.com/dkhpkccgup?key=f93978b429dfbcf244b3718ef67223ef",
    "downloadLink3": "https://otieu.com/4/10282820",
    "downloadLink1": "https://prototypesorting.com/dkhpkccgup?key=f93978b429dfbcf244b3718ef67223ef"
},
{
    "id": "post-ap3utu",
    "uploadTime": "2025-12-22T15:15:31.429Z",
    "title": "Bangarraju Full Movie Download | Full HD 1080p | A Grand Family Fantasy EXPERIENCE",
    "mediaImage": "https://raw.githubusercontent.com/Filmixo/movie/refs/heads/main/Image Files/Bangarraju.jpg",
    "videoDuration": "02:03:33",
    "paragraphs": [
        "Directed by KALYAN KRISHNA KURASALA and produced by NAGARJUNA AKKINENI, Bangarraju blends divine fantasy with emotional family drama, driven by the charismatic dual performance of NAGARJUNA AKKINENI and the youthful energy of NAGA CHAITANYA. The creators aimed to expand the legacy of Soggade Chinni Nayana with richer visuals and deeper emotions, and audiences widely praised its humor, music, and nostalgic storytelling, calling it a wholesome theatrical EXPERIENCE with a crowd-pleasing CLIMAX.",
        "Watch or download Bangarraju now and enjoy this entertaining family fantasy in stunning Full HD quality."
    ],
    "hashtags": "#filmixo #viralfilm #trendingmovie #blockbuster #popular",
    "downloadLink2": "https://prototypesorting.com/dkhpkccgup?key=f93978b429dfbcf244b3718ef67223ef",
    "downloadLink3": "https://otieu.com/4/10282820",
    "downloadLink1": "https://youtu.be/hy6v5wfScNM?si=dOeU_2ULe7d5sHVL"
},
{
    "id": "post-xaddqi",
    "uploadTime": "2025-12-18T09:15:57.374Z",
    "title": "Salaar: Part 3 – Final Bloodshed Full Movie Download | Full HD 1080p | Witness the Ultimate End of Khansaar",
    "mediaImage": "https://raw.githubusercontent.com/Filmixo/movie/refs/heads/main/Image Files/salar3.jpg",
    "videoDuration": "02:04:55",
    "paragraphs": [
        "Directed by PRASHANTH NEEL and produced by VIJAY KIRAGANDUR, this grand conclusion was envisioned as the definitive collapse and rebirth of the Khansaar empire. PRABHAS delivers his most explosive performance yet, as the creators focused on the tragic resolution between Deva and Vardha. Their vision was to immortalize this trilogy through a massive spectacle of sacrifice, betrayal, and raw vengeance.",
        "Global audiences are hailing this finale as an absolute ACTION milestone that redefines the genre. Viewers have been electrified by the shocking narrative twists and the earth-shattering intensity of the final CLIMAX between the two legends. It is described as a soul-stirring, high-octane journey that provides a breathtaking and perfect closure to this dark cinematic era.",
        "Witness the final bloodbath and see who remains standing in the ruins of the throne today!"
    ],
    "hashtags": "#filmixo #viralfilm #trendingmovie #blockbuster #popular",
    "downloadLink2": "https://prototypesorting.com/dkhpkccgup?key=f93978b429dfbcf244b3718ef67223ef",
    "downloadLink3": "https://otieu.com/4/10282820",
    "downloadLink1": "https://youtu.be/inBHIRshaVM?si=UtFzA93QiOeeMHZi"
},
{
    "id": "post-vq022n",
    "uploadTime": "2025-12-18T06:28:42.043Z",
    "title": "Kantara Full Movie Download: Watch in Full HD 1080p || Divine Blockbuster Action Drama",
    "mediaImage": "https://i.ytimg.com/vi/WhAO9-AfYLM/maxresdefault.jpg",
    "videoDuration": "02:11:05",
    "paragraphs": [
        "Experience the divine masterpiece written, directed, and led by the phenomenal Rishab Shetty. Produced by Vijay Kiragandur of Hombale Films, this cinematic marvel blends folklore with intense action. The creators emphasize a deep connection to roots, delivering a visceral performance that has redefined Indian storytelling on a global scale.",
        "Audiences worldwide are mesmerized by the \"Bhoota Kola\" sequences and the hair-raising climax. Viewers describe it as a soul-stirring journey filled with cultural richness and adrenaline-pumping thrills. It is more than a movie; it's an immersive legendary experience that will leave you stunned.",
        "To witness this epic folklore saga, click the button below to download the full movie now!"
    ],
    "hashtags": "#filmixo #viralfilm #trendingmovie #blockbuster #popular",
    "downloadLink2": "https://prototypesorting.com/x0tq9pfa?key=5eaa0857eb30fd0efb62daca7ba27aec",
    "downloadLink3": "https://otieu.com/4/10291975",
    "downloadLink1": "https://youtu.be/0DQXndSZxzA?si=2TsBQ4Eekz0s99e-"
},
{
    "id": "post-q59hou",
    "uploadTime": "2025-12-18T06:11:55.011Z",
    "title": "Narsimha Full Movie Download: Watch in Full HD 1080p | Action & Drama Extravaganza",
    "mediaImage": "https://i.ytimg.com/vi/uWZJnKULhYk/maxresdefault.jpg",
    "videoDuration": "01:53:48",
    "paragraphs": [
        "Directed by the visionary N. Chandra and produced by M. Saravanan, Narsimha is a high-octane masterpiece. Lead actor Sunny Deol delivers a powerhouse performance that defines \"angry young man\" cinema. The creators focused on raw intensity and justice, crafting a gritty narrative that remains a cult classic for action lovers.",
        "Audience reviews hail this film as an adrenaline-fueled emotional rollercoaster. Fans rave about the iconic dialogues and the legendary face-off against the villainous Baapji. It’s a gripping tale of redemption that keeps viewers on the edge of their seats until the very last frame.",
        "To experience this legendary action drama, click the button below to download the full movie!"
    ],
    "hashtags": "#filmixo #viralfilm #trendingmovie #blockbuster #popular",
    "downloadLink2": "https://prototypesorting.com/dkhpkccgup?key=f93978b429dfbcf244b3718ef67223ef",
    "downloadLink3": "https://otieu.com/4/10282820",
    "downloadLink1": "https://youtu.be/2eVV1v3z4lg?si=3CpbVykFE9vBzjp4"
},
{
    "id": "post-y55thn",
    "uploadTime": "2025-12-17T08:07:50.787Z",
    "title": "Avatar Full HD Movie Download | James Cameron’s Epic Sci-Fi Adventure",
    "mediaImage": "https://www.ronitbaras.com/wp-content/uploads/2023/02/avatar-movie.jpg",
    "videoDuration": "02:12:37",
    "paragraphs": [
        "Directed by James Cameron, Avatar brings Pandora to life with visionary storytelling. Produced by James Cameron and Jon Landau, and starring Sam Worthington, Zoe Saldaña, and Sigourney Weaver, the film blends groundbreaking VFX with emotional depth, redefining cinematic science fiction on a global scale.",
        "Audiences worldwide praised Avatar for its immersive visuals, emotional connection, and unforgettable world-building. Viewers described the experience as visually breathtaking and deeply engaging, making it a must-watch sci-fi classic. To download the full movie in HD, click the button below and enjoy the journey."
    ],
    "hashtags": "#filmixo #viralfilm #trendingmovie #blockbuster #popular",
    "downloadLink2": "https://prototypesorting.com/x0tq9pfa?key=5eaa0857eb30fd0efb62daca7ba27aec",
    "downloadLink3": "https://otieu.com/4/10291975",
    "downloadLink1": "https://shorturl.at/Evhi9"
},
{
  "id": "Rav83C",
  "uploadTime": "2025-12-16T23:12:01",
  "title": "Shalar Full Movie Download in HD – Watch the Most Talked-About Film Online",
  "mediaImage": "https://static.toiimg.com/photo/101561141.jpeg",
  "paragraphs": [
    "According to the director and producers, Shalar was crafted with a clear vision—to deliver a powerful cinematic experience that blends realism, emotion, and strong storytelling. They focused heavily on character depth, visual tone, and pacing to ensure the audience stays engaged throughout the film. From their point of view, every scene was designed with purpose, aiming to create an impact that feels authentic rather than exaggerated. They believe Shalar represents their most focused and mature work to date.",
    "From the audience’s perspective, Shalar has managed to spark strong reactions and discussions. Viewers are praising the intense performances, gripping moments, and emotionally charged scenes. Many feel the story connects well with real-life struggles, while others appreciate the balance between drama and entertainment. Overall, audiences describe the movie as engaging, thought-provoking, and worth watching, especially for those who enjoy meaningful cinema."
  ],
  "hashtags": "#trending",
  "downloadLink1": "https://youtube.com",
  "videoDuration": "02:03:52",
  "downloadLink2": "https://google.com",
  "downloadLink3": "https://google.com"
}
]
